Revit 2027 API
LabelUtils.GetLabelForDiscipline Method
 Gets the user-visible name for a discipline.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static string GetLabelForDiscipline(
	ForgeTypeId disciplineTypeId
)
Public Shared Function GetLabelForDiscipline (
	disciplineTypeId As ForgeTypeId
) As String
public:
static String^ GetLabelForDiscipline(
	ForgeTypeId^ disciplineTypeId
)
static member GetLabelForDiscipline :
        disciplineTypeId : ForgeTypeId -> string
Parameters
disciplineTypeId ForgeTypeId
 Identifier of the discipline.
Return Value
String
 Returns the user-visible name for a discipline.
Exceptions
Exception | Condition
ArgumentException |  Discipline must have a definition.
ArgumentNullException |  A non-optional argument was null
Remarks
 The name is obtained in the current Revit language.
See Also
Reference
LabelUtils Class
Autodesk.Revit.DB Namespace